Repository: ciklon-z/amnesia
Catalog: wiki/src/doc/first_steps/manual_usb_installation/mac.*.po
Languages: fr

source: [[!meta title="Manually installing onto a USB stick, for Mac"]]
fr: [[!meta title="Installation manuelle sur une clé USB, pour Mac"]]

source: [[!inline pages="doc/first_steps/manual_usb_installation.intro" raw="yes"]]
fr: [[!inline pages="doc/first_steps/manual_usb_installation.intro.fr" raw="yes"]]

source: This technique uses the command line.
fr: Cette méthode utilise les lignes de commande.

source: **Warning!** If at some point you are not sure about a device name it is recommended to stop proceeding otherwise **you might risk overwriting any hard drive on the system**. Proceed at your own discretion! We admit that this method is pretty crude at the moment and we are working on a more intuitive one.
fr: **Attention !** Si à un moment vous n'êtes pas sûr du nom du périphérique il est recommandé d'arrêter là sinon **vous pourriez écraser n'importe quel disque dur du système**. Faites selon votre jugement ! Nous admettons que cette méthode est un peu rustique pour l'instant, nous travaillons actuellement sur une méthode plus intuitive.

source: Step 1: Setup rEFIt.
fr: Étape 1 : Configurer rEFIt.

source: You need to have [rEFIt](http://refit.sourceforge.net/) installed and working on the mac.
fr: Vous devez avoir [rEFIt](http://refit.sourceforge.net/) installé et qui fonctionne sur votre mac.

source: If you need help with rEFIt, look at [their installation documentation](http://refit.sourceforge.net/doc/c1s1_install.html).
fr: Si vous avez besoin d'aide pour rEFIt, voir [leur documentation d'installation (en anglais)](http://refit.sourceforge.net/doc/c1s1_install.html).

source: Step 2: Find out the device name of the destination USB stick.
fr: Étape 2 : Trouver le nom du périphérique de la clé USB de destination.

source: The device name should be something like `/dev/disk1`, `/dev/disk2`, etc.
fr: Le nom du périphérique devrait être ressemblant à `/dev/disk1`, `/dev/disk2`, etc.

source: If you're not sure about the precise device name, do the following.
fr: Si vous n'êtes pas sûr du nom du périphérique, faites ceci.

source: Unplug the destination USB stick.
fr: Débrancher la clé USB de destination.

source: Type the following command:
fr: Taper la commande suivante :

source: This will list all the current storage devices:
fr: Tous les périphériques de stockage actuels seront listés :

source: [[!img mac/diskUtil_list_empty_small.png link=no alt="Empty list"]]
fr: [[!img mac/diskUtil_list_empty_small.png link=no alt="Liste vide"]]

source: Plug back the destination USB stick and run the same command as before:
fr: Brancher à nouveau la clé USB de destination et lancer à nouveau la commande précédente :

source: A new device should appear in the list of storage devices. Check that the size of the device corresponds to your destination USB drive. In my case the USB drive is 4.0 GB and the location is /dev/disk1:
fr: Un nouveau périphérique devrait apparaître dans la liste des périphériques de stockage. Vérifier que la taille du périphérique correspond à votre clé USB de destination. Dans ce cas la clé USB fait 4.0 GB et l'emplacement est /dev/disk1 :

source: [[!img mac/diskUtil_list_USB_shows_small.png link=no alt="A new storage device appeared at the end of the list"]]
fr: [[!img mac/diskUtil_list_USB_shows_small.png link=no alt="Un nouveau périphérique de stockage apparaît à la fin de la liste"]]

source: Step 3: Unmount the USB drive.
fr: Étape 3 : Démonter la clé USB.

source: In the terminal window issue the following command, again replacing the destination with the device name found in step 1.
fr: Dans la fenêtre du terminal, taper la commande suivante, remplaçant encore une fois la destination par le nom du périphérique trouvé à l'étape 1.

source: [[!img mac/diskUtil_unmountDisk_small.png link=no alt="Unmounting the USB drive"]]
fr: [[!img mac/diskUtil_unmountDisk_small.png link=no alt="Démontage de la clé USB"]]

source: Step 4: Do the copy from the terminal.
fr: Étape 4 : Faire la copie depuis un terminal.

source: In the terminal window issue the following command, replacing `[tails.iso]` by the path to the ISO image that you want to copy and `[destination]` by the device name found in step 1.
fr: Dans la fenêtre du terminal, taper la commande suivante, en remplaçant `[tails.iso]` par le chemin jusqu'à l'image ISO que vous voulez copier et `[destination]` par le nom du périphérique trouvé à l'étape 1.

source: If you are not sure about the path to the ISO image or if you get a "No such file or directory" error, you can first type `cat`, followed by a space, and then drag and drop the icon of the ISO image from a file browser onto the terminal. This should insert the correct path to the ISO image in the terminal. Then type the rest of the command.
fr: Si vous n'êtes pas sûr du chemin de votre image ISO ou si vous obtenez l'erreur "No such file or directory", vous pouvez taper `cat`, suivie d'un espace, puis faire glisser l'icône de l'image ISO du navigateur de fichier dans le terminal. Cela devrait insérer le chemin correcte allant à votre image ISO dans le terminal. Taper ensuite le reste de la commande.

source: You should get something like this:
fr: Vous devriez obtenir quelque chose comme ça :

source: [[!img mac/cat_copy_to_USB_small.png link=0 alt="Copying the tails.iso to the USB drive"]]
fr: [[!img mac/cat_copy_to_USB_small.png link=0 alt="Copie de tails.iso vers la clé USB"]]

source: Step 5: Press enter and wait.
fr: Étape 5 : Taper entrée et attendre.

source: If you don't see any error message, Tails is being copied onto the key. The whole process might take a while, generally a few minutes. Be patient…
fr: Si vous n'obtenez aucun message d'erreur, Tails est en train d'être copié vers votre clé. Le processus complet peut prendre du temps, quelques minutes. Soyez patient...

source: Step 6:
fr: Étape 6 :

source: Reboot your Mac, wait for the rEFIt menu and select the USB drive to boot.
fr: Redémarrer votre Mac, attendre le menu rEFIt et sélectionner la clé USB sur laquelle démarrer.

source: Note that Tails developers are in general not very knowledgeable about Mac. Any additional information is welcome.
fr: Veuillez noter que les développeurs de Tails ne sont en général pas experts en Mac. Toute information complémentaire est la bienvenue.

source: An alternative, easier method was suggested; it looks like it requires a fairly recent version of OSX:
fr: Une méthode alternative, plus facile a été suggérée; il semble qu'elle nécessite une version très récente de OSX :

source: Open Disk Utility
fr: Ouvrir Disk Utility

source: Find The Drive
fr: Trouver le périphérique

source: Format Tab
fr: Formatter le disque

source: Source is ISO File
fr: Source correspond à l'image ISO

source: Destination is USB Drive
fr: Destination est la clé USB
