Repository: ciklon-z/amnesia
Catalog: wiki/src/doc/first_steps/startup_options/administration_password.*.po
Languages: fr

source: [[!meta title="Setting an administration password"]]
fr: [[!meta title="Définir un mot de passe d'administration"]]

source: In Tails, an administration password is required to perform system administration tasks.<br/> For example:
fr: Dans Tails, un mot de passe d'administration est nécessaire pour effectuer des tâches d'administration.<br/> Par exemple:

source: To install new programs and packages
fr: Pour installer de nouveaux programmes et paquets

source: To access the internal hard disks of the computer
fr: Pour avoir accès au disque dur interne de l'ordinateur

source: To execute commands with <span class="command">sudo</span>
fr: Pour lancer des commandes avec <span class="command">sudo</span>

source: **By default, the administration password is disabled for better security.** This can prevent an attacker with physical or remote access to your Tails system to gain administration privileges and perform administration tasks against your will.
fr: **Par défaut, le mot de passe d'administration est désactivé pour plus de sécurité.** Ce qui peut empêcher un attaquant ayant un accès physique ou à distance à votre système Tails d'obtenir les droits d'administration et d'effectuer des tâches d'administration contre votre volonté.

source: 1. When <span class="application">Tails greeter</span> appears, in the <span class="guilabel">Welcome to Tails</span> window, click on the <span class="button">Yes</span> button. Then click on the <span class="button">Forward</span> button to switch to the <span class="guilabel">Administration password</span> window.
fr: 1. Lorsque <span class="application">Tails greeter</span> apparaît, dans la fenêtre <span class="guilabel">Bienvenue dans Tails</span>, cliquez sur le bouton <span class="button">Oui</span>. Puis cliquez sur le bouton <span class="button">Forward</span> pour passer à la fenêtre <span class="guilabel">Mot de passe d'administration</span>.

source: 2. In the <span class="guilabel">Administration password</span> window, specify a password of your choice in both the <span class="guilabel">Password</span> and <span class="guilabel">Verify Password</span> text boxes. Then click on the <span class="button">Login</span> button to start the <span class="application">GNOME Desktop</span>.
fr: 2. Dans la fenêtre <span class="guilabel">Mot de passe d'administration</span> saisissez un mot de passe de votre choix dans les deux champs <span class="guilabel"> Mot de passe</span> et <span class="guilabel">Vérification du mot de passe</span>. Cliquez ensuite sur le bouton <span class="button">Connexion</span> pour lancer le <span class="application">Bureau GNOME</span>.

source: How to open a root terminal
fr: Pour ouvrir un terminal administrateur

source: To open a root terminal, you can do any of the following:
fr: Pour ouvrir un terminal administrateur, vous pouvez faire soit :

source: - Choose <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;â–¸ <span class="guisubmenu">Accessories</span>&nbsp;â–¸ <span class="guimenuitem">Root Terminal</span></span>.
fr: - Choisir <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;â–¸ <span class="guisubmenu">Accessoires</span>&nbsp;â–¸ <span class="guimenuitem">Terminal administrateur</span></span>.

source: Execute <span class="command">sudo -i</span> in a terminal.
fr: Taper <span class="command">sudo -i</span> dans un terminal.
