Repository: ciklon-z/amnesia
Catalog: wiki/src/support/known_issues.*.po
Languages: fr

source: [[!meta title="Known issues"]]
fr: [[!meta title="Problèmes connus"]]

source: Some machines have been reported to have problems starting Tails.
fr: Certaines machines sont connues pour avoir des problèmes à démarrer Tails.

source: This list might not be accurate nor complete.
fr: Cette liste n'est sans doute ni précise ni exhaustive.

source: Tails will not use memory after the first 3 GB
fr: Tails n'utilisera pas de mémoire vive au-delà des 3 premiers GB

source: Tails will not currently use more than 3 GB of memory, even if more is installed on the system. This is a limitation of the [[current kernel selection mechanism|todo/nx_bit]].
fr: Actuellement, Tails n'utilisera pas plus de 3 GB de mémoire, quand bien même le système en contient plus. Il s'agit d'une limitation du [[méchanisme de sélection du noyau actuel|todo/nx_bit]].

source: Tails will only use one CPU core
fr: Tails n'utilisera qu'un cœur du processeur

source: Tails will not currently use more than one CPU core, even if there is more core or more CPUs installed on the system. This is a limitation of the [[current kernel selection mechanism|todo/nx_bit]].
fr: Actuellement, Tails n'utilisera pas plus d'un cœur du processeur, quand bien même le système contient plus d'un cœur ou plus d'un processeur. Il s'agit d'une limitation du [[méchanisme de sélection du noyau actuel|todo/nx_bit]].

source: Tails does not erase all the system memory on shutdown
fr: Tails n'efface pas la totalité de la mémoire à l'extinction

source: Tails does not consistently [[erase all system memory as it should|bugs/sdmem_does_not_clear_all_memory]]. It depends on the overall system memory, but it currently fails to properly erase around 1.5 GB on a 4 GB system.
fr: Tails n'efface pas de façon systématique [[la totalité de la mémoire comme il le devrait|bugs/sdmem_does_not_clear_all_memory]]. Ça dépend généralement de la mémoire du système, mais en l'état actuel des choses, sur un système contenant 4 GB de mémoire vive, à peu près 1.5 GB ne sera pas effacé.

source: Connecting to FTP servers is not possible
fr: Se connecter à des serveurs FTP n'est pas possible

source: Public FTP servers on the Internet are not reachable using Tails. See [[the corresponding task|todo/fix_Internet_FTP_support]] for more details.
fr: Les serveurs FTP publiques sur Internet ne sont pas joignables avec Tails. Voir la [[tâche correspondante|todo/fix_Internet_FTP_support]] pour plus de détails.

source: Apple hardware
fr: Matériel Apple

source: For the moment, Tails has a very limited support for Apple hardware.
fr: Pour l'instant, Tails a une prise en charge très limitée du matériel Apple.

source: Most recent Apple hardware does not boot without UEFI, and currently Tails does not start with UEFI. See the corresponding [[ticket|/todo/UEFI]].
fr: Le matériel Apple le plus récent, ne démarre pas sans UEFI, alors qu'actuellement Tails ne démarre pas avec UEFI. Voir le [[ticket|/todo/UEFI]] correspondant.

source: See also [[bugs/Some old Macbooks running Lion 10.7 not booting Lion..can we get booting fixed ?]].
fr: Voir également les [[bugs/Some old Macbooks running Lion 10.7 not booting Lion..can we get booting fixed ?]].

source: Do not start on USB sticks created using Tails USB Installer.
fr: Ne démarre pas sur clé USB installée via l'installeur USB Tails.

source: With BIOS versions A03 06/03/2012
fr: Avec un BIOS versions A03 06/03/2012

source: Error message: `Invalid partition table!`
fr: Message d'erreur : `Invalid partition table!`

source: With BIOS version A17 02/22/2012
fr: Avec un BIOS version A17 02/22/2012

source: Some users reported that the legacy BIOS shipped by Dell doesn't know how to deal with the GPT partition scheme installed by Tails USB Installer.
fr: Des utilisateurs ont rapporté que l'ancien BIOS livré par Dell ne prend pas en charge le schéma de partition GPT installé par l'installeur USB Tails.

source: See the corresponding [[ticket|/bugs/ThinkPad_X220_vs_GPT]].
fr: Voir le [[ticket|/bugs/ThinkPad_X220_vs_GPT]] correspondant.

source: Default search engine is Google for some languages
fr: Dans certaines langues, le moteur de recherche par défaut est Google

source: [[Some languages gets Google as the default search engine|bugs/languages_without_a_localized_Startpage_get_Google_by_default]] instead of Startpage.
fr: [[Dans certaines langues, Google est le moteur de recherche par défaut|bugs/languages_without_a_localized_Startpage_get_Google_by_default]] à la place de Startpage.

source: After using liveusb-installer, the "emergency shutdown" doesn't work.
fr: Après avoir utilisé l'installeur USB Tails, l'"extinction d'urgence" ne fonctionne pas.

source: The liveusb-installer messes a bit too much with the USB devices for the "emergency shutdown on media removal" feature to continue working after using it. If you believe this feature is critical for the session you're running, we advice you to reboot Tails.
fr: L'installeur USB Tails déconne un tout petit peu trop avec les périphérique USB pour que la fonction d'"extinction d'urgence sur retrait de support" fonctionne encore après son utilisation. Si vous pensez que cette fonctionnalité est cruciale pour votre session, nous vous conseillons de redémarrer Tails.
